In [2]:
import pandas as pd # numpy 를 as np 한거처럼 pandas도 일반적으로 as pd 하여 pd로 짧게 쓴다.
                     #데이터를 쉽게 다루기 위해 만들어짐

In [9]:
dict1={
    "math":[20,34,80,100,90],
    "korea":[20,34,80,100,90],
    "eng":[20,34,80,100,90]
}
df = pd.DataFrame(dict1)
df # 표로 보여줌
# df.to_csv('1.csv') # 엑셀 파일을 만들어줌
# df.to_csv('C:\\lsb\\html\\1.csv') #파일 저장위치 지정 가능

   math  korea  eng
0    20     20   20
1    34     34   34
2    80     80   80
3   100    100  100
4    90     90   90

In [6]:
pwd #현재 작업 파일 저장 위치

'C:\\Users\\tj'

In [30]:
# df[df['math']>70]['eng'] #'math'가 70점 이상인거
# df[df['math']>70][['eng','korea']] # pandas에는 dataframe 타입과 series타입이 있다. 한개만가져오면 dataframe, 한개 이상 series  
df[df['math']>70]

   math  korea  eng
2    80     80   80
3   100    100  100
4    90     90   90

In [15]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
chipo = pd.read_csv(url, sep='\t')

In [19]:
# chipo #url에서 제공하는 csv파일을 읽어옴
# chipo.head(10) # 상단10개만 가져오기
chipo.tail(10) # 하단 10개

,order_id,quantity,item_name,choice_description,item_price
4612,1831,1,Carnitas Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$9.25
4613,1831,1,Chips,NaN,$2.15
4614,1831,1,Bottled Water,NaN,$1.50
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4616,1832,1,Chips and Guacamole,NaN,$4.45
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [21]:
chipo.shape #4622행 5열

(4622, 5)

In [31]:
chipo.shape[1] #1번째 행의 5개열

5

In [32]:
len('aaa')

3

In [42]:
# [len(i) for i in chipo['item_name']]

In [35]:
chipo.to_csv("C:\\Users\\tj\\test.csv")

In [43]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [86]:
df = chipo[['order_id','quantity','item_name']] 
df_c = df.groupby('item_name').sum() #item_name 별로 그룹화하고 , item_name 별 그룹의 총합
df_c = df_c.sort_values(['quantity'] , ascending=False)
df_c.head(5)
# 여기는 'order_id','quantity','item_name' 정수값들만 사용했기때문에 아래처럼 빨간색 경고? 안뜸

                     order_id  quantity
item_name
Chicken Bowl           713926       761
Chicken Burrito        497303       591
Chips and Guacamole    449959       506
Steak Burrito          328437       386
Canned Soft Drink      304753       351

In [87]:
#가장 주문량이 많은 항목찾기
c=chipo.groupby('item_name') #item_name 별로 그룹화
c=c.sum() #item_name 별 그룹의 총합
c = c.sort_values(['quantity'] , ascending=False)
c.head(5)
#chipo의 choice_description, item_price의 값들은 string 타입이기때문에 아래 sum() 메서드를 사용했을때 아래 빨간색 경고??처럼 무언가 뜬다

C:\Users\tj\AppData\Local\Temp\ipykernel_10452\1747176969.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  c=c.sum() #item_name 별 그룹의 총합

                     order_id  quantity
item_name
Chicken Bowl           713926       761
Chicken Burrito        497303       591
Chips and Guacamole    449959       506
Steak Burrito          328437       386
Canned Soft Drink      304753       351

In [54]:
import numpy as np

In [68]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df.head()

     A      B         C         D
0  foo    one -1.277846  0.038314
1  bar    one  0.055735 -1.633316
2  foo    two -0.257184  0.342347
3  bar  three -0.072780 -0.721732
4  foo    two -0.349797  0.104168

In [69]:
grouped = df.groupby("A") # A로 그룹핑해서 2개의 덩어리 foo와 bar로 나뉨
for i in grouped:
    pass
# print(grouped.sum(), grouped.count(), grouped.mean())
df3 = grouped.agg(['sum','count'])
df3

                     B              C               D
                   sum count      sum count       sum count
A
bar        onethreetwo     3  0.26306     3 -3.241453     3
foo  onetwotwoonethree     5 -1.01148     5  0.770994     5

In [70]:
grouped.apply(lambda x:x.sort_values('B')) # A칼럼으로 그룹화하고 bar,foo
                                            # B칼럼으로 각각의 그룹별로 B칼럼기준으로 정렬 one,two,three

         A      B         C         D
A
bar 1  bar    one  0.055735 -1.633316
    3  bar  three -0.072780 -0.721732
    5  bar    two  0.280105 -0.886405
foo 0  foo    one -1.277846  0.038314
    6  foo    one  0.513131 -0.200143
    7  foo  three  0.360216  0.486308
    2  foo    two -0.257184  0.342347
    4  foo    two -0.349797  0.104168

In [80]:
def f(x):
    list1=[]
    for i in range(x):
        list1.append({x:str(x)+"입니다."})
    return list1

In [83]:
list(map(f,[2,3,4,5,6]))

[[{2: '2입니다.'}, {2: '2입니다.'}],
 [{3: '3입니다.'}, {3: '3입니다.'}, {3: '3입니다.'}],
 [{4: '4입니다.'}, {4: '4입니다.'}, {4: '4입니다.'}, {4: '4입니다.'}],
 [{5: '5입니다.'}, {5: '5입니다.'}, {5: '5입니다.'}, {5: '5입니다.'}, {5: '5입니다.'}],
 [{6: '6입니다.'},
  {6: '6입니다.'},
  {6: '6입니다.'},
  {6: '6입니다.'},
  {6: '6입니다.'},
  {6: '6입니다.'}]]

In [76]:
list(map(lambda x:{x:str(x)+"입니다."},[2,3,4,5,6])) #map은 데이터 갯수와 출력 갯수가 같다 , 
                                                      #근데 이런건 위에 처럼 그냥 함수선언해서 하는게 더 간결하다 
                                                      #람다는 식이 간결할때 사용

[{2: '2입니다.'}, {3: '3입니다.'}, {4: '4입니다.'}, {5: '5입니다.'}, {6: '6입니다.'}]

In [72]:
list(filter(lambda x:x%2==0,[2,3,4,5,6])) #filter는 filter에 들어가는 함수 true,false를 반환하는 predicate타입의 함수이당
                                           # 값으로 true만 반환 , 데이터 개수와 출력 개수가 다르다.

[2, 4, 6]

In [88]:
from functools import reduce #reduce import

In [91]:
a,b=(3,5) # 파이썬은 이런식으로 작성하면 key와 value로 알아서 나눠줌
a

3

In [108]:
def merge_dict(a,b): 
    key, value = b
    a[value] = a.get(value,[])+[key]
    print(a,b)
    return a

In [116]:
reduce(merge_dict,{'1':'a','2':'a'}.items(),{}) 
#reduce(merge_dict함수, {'1':'a','2':'a'}를 .items()하면  [('1', 'a'),('2', 'a')]튜플이 들어있는 리스트 만듬, {} 빈 딕셔너리 초기값)
# merge_dict 는 (a,b)의 매개변수를 받는다. a 는 초기값을 설정, b는 literable한 데이터 (순서가 좀 헷갈림 reduce는 반대로 되어있음)
# b는 literable한 데이터 [('1', 'a'),('2', 'a')]튜플이 2개 들어있는 리스트이 들어오고 a에는 {},
# 그래서 key, value = b   위의 리스트를 순회하면, 'key'와 'value'가 다음과 같이 설정됩니다:

# 첫 번째 순회: key = '1', value = 'a'
# 두 번째 순회: key = '2', value = 'a' ('1', 'a')('2', 'a') 이런식으로 튜플을 만들어줌 

# a[value] => 처음 a는 빈딕셔너리 value는 'a' , a['a']는 a딕셔너리에 'a' 키 값을 만듬
# a.get(value,[]) => a딕셔너리의 value 키가 있으면 값을 가져오고 없으면 [] 빈 리스트를 만든다 => a.get('a',[]) => a라는 키가 있으면 
# 값을 가져오고 없으면 []빈 리스트를 만든다.
# +[key] => a 딕셔너리에서 value 키에 해당하는 값에 [key] 리스트를 더한다. 이렇게 하면 해당 값의 리스트에 key를 추가하는 것이 된다.
# a['a'] = a.get('a',[]) + ['1'] => 처음에 'a'키가 없어서 빈리스트가 생성되고 거기에 ['1'] 리스트르 더하면 []+['1'] = ['1'] 이 된다.
# return a => reduce는 순환하는 데이터의 값을 처리해주는 함수니까 {'a': ['1']} 이 값이 다시 merge_dict의 a 매개변수로 
# 초기값으로 들어가서 반복된당 그러면

# b는 literable한 데이터 [('1', 'a'),('2', 'a')]튜플이 2개 들어있는 리스트이 들어오고 a에는 {'a': ['1']},
# a['a'] 의 키값이 이미 존재 하니 a['a'] = a.get('a',[]) + ['2'] => , ['1'] + ['2'] = ['1','2']  / 'a'의 키의 값 ['1'], ['key']인 ['2'] 
# a 딕셔너리에 키 'a' , value ['1','2'] /// a = {'a': ['1', '2']}

# reduce(merge_dict,{'1':'a','2':'a'}.items(),{})['a'] # 하면 ['1','2'] 출력됨




#gpt 설명 :
# reduce 함수를 사용하여 여러 딕셔너리 항목을 결합하고 그룹화하는 과정을 수행합니다. 이때 '1'과 '2'를 'a'로 그룹화하게 됩니다.

# merge_dict(a, b) 함수는 두 개의 딕셔너리 항목을 받아서 값을 그룹화하는 역할을 합니다. 함수 내용을 정리하면 다음과 같습니다:

# key, value = b: 튜플 b에서 첫 번째 요소를 key로, 두 번째 요소를 value로 할당합니다.
# a[value] = a.get(value, []) + [key]: 딕셔너리 a에서 value라는 키에 해당하는 값을 가져오거나 없다면 빈 리스트를 할당합니다. 이후 해당 값을 가져온 리스트에 key를 추가하여 값을 그룹화합니다.
# reduce(merge_dict, {'1': 'a', '2': 'a'}.items(), {}): reduce 함수에 위에서 정의한 merge_dict 함수와 초기값으로 빈 딕셔너리({})를 사용하여 주어진 딕셔너리를 그룹화합니다. {'1': 'a', '2': 'a'}.items()는 딕셔너리의 항목을 튜플로 변환하여 리스트로 만든 것입니다.

# 이렇게 하면 result에는 {'a': ['1', '2']}와 같이 'a' 값으로 그룹화된 결과가 저장될 것입니다.

('1', 'a')
{'a': ['1']} ('1', 'a')
('2', 'a')
{'a': ['1', '2']} ('2', 'a')

{'a': ['1', '2']}

In [97]:
{'1':'a','2':'a'}.items()

dict_items([('1', 'a'), ('2', 'a')])

In [98]:
{'1':'a','2':'a'}.get('3',[])

[]

In [99]:
{'1':'a','2':'a'}.get('1',[])

'a'

<img src="map.gif"/>